# Importing Libraries

In [0]:
# Importing the pandas for data manipulation and analysis
import pandas as pd

# Data Understanding - Phase 1

In [25]:
# priviewing the dataset
df1 = pd.read_excel('/content/cells_geo_description.xlsx', delimiter = ',')
df1

# view column names to help us get familiar with the dataset
df1.columns.values.tolist()

['Column name', 'Description', 'Format']

In [26]:
# load first five rows to better understand the dataset
df1.head(5)

    Column name        Description  Format
0        VILLES               City  String
1        STATUS  In Service or not  String
2  LOCALISATION  in ABIDJAN or not  String
3    DECOUPZONE  Geographical Zone  String
4      ZONENAME       Name of Zone  String

In [36]:
# priviewing the datasets
df2 = pd.read_csv('/content/cells_geo.csv', delimiter=';',header=1,names=['City','Status','Localisation','Decoup_Zone','Zone_Name','Longitude','Latitude','Region','Area','Cell_ID','Site_ID'])

# view column names to help us get familiar with the dataset
df2.columns.values.tolist()

['City',
 'Status',
 'Localisation',
 'Decoup_Zone',
 'Zone_Name',
 'Longitude',
 'Latitude',
 'Region',
 'Area',
 'Cell_ID',
 'Site_ID']

In [37]:
# load first five columns to better understand the dataset
df2.head(5)

      City      Status Localisation  ... Area     Cell_ID     Site_ID
1   ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2   ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3  ASSINIE  In Service    INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service    INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f
5  ASSINIE  In Service    INTERIEUR  ...  NaN  0b4f56438f  8a1e6ce31f

[5 rows x 11 columns]

In [32]:
# previewing the datasets
df3 = pd.read_excel('/content/CDR_description.xlsx', delimiter = ',')
df3.columns.values.tolist()

['Column name', 'Description', 'Format']

In [33]:
# load first five columns to better understand the dataset
df3.head(5)

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String

In [41]:
# priviewing the datasets
df4 = pd.read_csv('/content/Telcom_dataset.csv',header=0,names=['Product','Value','Date_Time','Cell_On_Site','DW_A_Number_Int','DW_B_Number_Int','Country_A','Country_B','Cell_ID','Site_ID'])
df4.columns.values.tolist()

['Product',
 'Value',
 'Date_Time',
 'Cell_On_Site',
 'DW_A_Number_Int',
 'DW_B_Number_Int',
 'Country_A',
 'Country_B',
 'Cell_ID',
 'Site_ID']

In [42]:
df4.head(5)

  Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [43]:
# priviewing the dataset
df5 = pd.read_csv('/content/Telcom_dataset2.csv',header=1,names=['Product','Value','Date_Time','Cell_On_Site','DW_A_Number','DW_B_Number','Country_A','Country_B','Cell_ID','Site_ID'])
df5.columns.values.tolist()

['Product',
 'Value',
 'Date_Time',
 'Cell_On_Site',
 'DW_A_Number',
 'DW_B_Number',
 'Country_A',
 'Country_B',
 'Cell_ID',
 'Site_ID']

In [44]:
df5.head(5)

  Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
0   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
2   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
3     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO
4     sms      0  2012-05-07 23:05:41.0  ...     19e2e  /MMplBlWjh  /MMplBlWjh

[5 rows x 10 columns]

In [45]:
# priviewing the dataset
df6 = pd.read_csv('/content/Telcom_dataset3.csv',header=1, names=['Product','Value','Date_Time','Cell_On_Site','DW_A_Number_Int','DW_B_Number_Int','Country_A','Country_B','Cell_ID','Site_ID'])
df6.columns.values.tolist()

['Product',
 'Value',
 'Date_Time',
 'Cell_On_Site',
 'DW_A_Number_Int',
 'DW_B_Number_Int',
 'Country_A',
 'Country_B',
 'Cell_ID',
 'Site_ID']

In [46]:
df6.head(5)

  Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
0     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
1   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
2     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
3   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA
4   Voice     10  2012-05-08 23:03:59.0  ...     19e2e  +e+xcimwre  +e+xcimwre

[5 rows x 10 columns]

# Data Understanding - Phase 2

In [49]:
# Checking descriptive stats for different datasets excluding column description stats
# cells geo stats
df2.info()
df2.describe()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3973 entries, 1 to 3973
Data columns (total 11 columns):
City            3973 non-null object
Status          3906 non-null object
Localisation    3973 non-null object
Decoup_Zone     3973 non-null object
Zone_Name       3967 non-null object
Longitude       3973 non-null float64
Latitude        3973 non-null float64
Region          3973 non-null object
Area            3951 non-null object
Cell_ID         3973 non-null object
Site_ID         3973 non-null object
dtypes: float64(2), object(9)
memory usage: 372.5+ KB

         Longitude     Latitude
count  3973.000000  3973.000000
mean     -4.877880     6.244970
std       1.300861     1.304289
min      -8.503889     0.000000
25%      -5.846139     5.338639
50%      -4.084500     5.475000
75%      -3.993444     6.872306
max      -0.000000    10.481861

In [55]:
# checking null values in cells geo dataset
df2.isnull().sum()

City             0
Status          67
Localisation     0
Decoup_Zone      0
Zone_Name        6
Longitude        0
Latitude         0
Region           0
Area            22
Cell_ID          0
Site_ID          0
dtype: int64

In [63]:
# checking unique values in cells geo dataset
print('City: ' + str(df2.City.nunique()) + ' out of ' + str(df2.City.count()))
print('Status: ' + str(df2.Status.nunique()) + ' out of ' + str(df2.Status.count()))
print('Localisation: ' + str(df2.Localisation.nunique()) + ' out of ' + str(df2.Localisation.count()))
print('Decoup_Zone: ' + str(df2.Decoup_Zone.nunique()) + ' out of ' + str(df2.Decoup_Zone.count()))
print('Zone_Name: ' + str(df2.Zone_Name.nunique()) + ' out of ' + str(df2.Zone_Name.count()))
print('Longitude: ' + str(df2.Longitude.nunique()) + ' out of ' + str(df2.Longitude.count()))
print('Latitude: ' + str(df2.Latitude.nunique()) + ' out of ' + str(df2.Latitude.count()))
print('Region: ' + str(df2.Region.nunique()) + ' out of ' + str(df2.Region.count()))
print('Area: ' + str(df2.Area.nunique()) + ' out of ' + str(df2.Area.count()))
print('Cell_ID: ' + str(df2.Cell_ID.nunique()) + ' out of ' + str(df2.Cell_ID.count()))
print('Site_ID: ' + str(df2.Site_ID.nunique()) + ' out of ' + str(df2.Site_ID.count()))

City: 504 out of 3973
Status: 1 out of 3906
Localisation: 2 out of 3973
Decoup_Zone: 15 out of 3973
Zone_Name: 33 out of 3967
Longitude: 1013 out of 3973
Latitude: 1023 out of 3973
Region: 19 out of 3973
Area: 6 out of 3951
Cell_ID: 3915 out of 3973
Site_ID: 1029 out of 3973

In [64]:
# checking unique values for Status column since it seems to have many duplicates of 'In Service' object and 1 unique obj
df2.Status.unique()

array(['In Service', nan], dtype=object)

In [81]:
# checking for duplicates
print(df2[df2.duplicated(keep=False)])

            City      Status  ...     Cell_ID     Site_ID
183   BONGOUANOU         NaN  ...  6750e0fb7b  20387d4292
184   BONGOUANOU         NaN  ...  6750e0fb7b  20387d4292
185   BONGOUANOU         NaN  ...  6750e0fb7b  20387d4292
243   BONGOUANOU         NaN  ...  6750e0fb7b  20387d4292
244   BONGOUANOU         NaN  ...  6750e0fb7b  20387d4292
...          ...         ...  ...         ...         ...
3685  BONGOUANOU         NaN  ...  6750e0fb7b  20387d4292
3689      ADJAME  In Service  ...  26a72e2271  5c565fbfb1
3690      ADJAME  In Service  ...  fcf8faec3b  5c565fbfb1
3698      ADJAME  In Service  ...  26a72e2271  5c565fbfb1
3699      ADJAME  In Service  ...  fcf8faec3b  5c565fbfb1

[68 rows x 11 columns]

In [52]:
# CDR Datasets descriptive stats
df4.info()
df4.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
Product            5001 non-null object
Value              5001 non-null int64
Date_Time          5001 non-null object
Cell_On_Site       5001 non-null object
DW_A_Number_Int    5001 non-null object
DW_B_Number_Int    5001 non-null object
Country_A          5001 non-null object
Country_B          5001 non-null object
Cell_ID            5001 non-null object
Site_ID            4285 non-null object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

             Value
count  5001.000000
mean     25.869626
std     101.934502
min       0.000000
25%       0.000000
50%       0.000000
75%      25.000000
max    4440.000000

In [67]:
# checking null values
df4.isnull().sum()

Product              0
Value                0
Date_Time            0
Cell_On_Site         0
DW_A_Number_Int      0
DW_B_Number_Int      0
Country_A            0
Country_B            0
Cell_ID              0
Site_ID            716
dtype: int64

In [71]:
# checking unique values
print('Product: ' + str(df4.Product.nunique()) + ' out of ' + str(df4.Product.count()))
print('Value: ' + str(df4.Value.nunique()) + ' out of ' + str(df4.Value.count()))
print('Date_Time: ' + str(df4.Date_Time.nunique()) + ' out of ' + str(df4.Date_Time.count()))
print('Cell_On_Site: ' + str(df4.Cell_On_Site.nunique()) + ' out of ' + str(df4.Cell_On_Site.count()))
print('DW_A_Number_Int: ' + str(df4.DW_A_Number_Int.nunique()) + ' out of ' + str(df4.DW_A_Number_Int.count()))
print('DW_B_Number_Int: ' + str(df4.DW_B_Number_Int.nunique()) + ' out of ' + str(df4.DW_B_Number_Int.count()))
print('Country_A: ' + str(df4.Country_A.nunique()) + ' out of ' + str(df4.Country_A.count()))
print('Country_B: ' + str(df4.Country_B.nunique()) + ' out of ' + str(df4.Country_B.count()))
print('Cell_ID: ' + str(df4.Cell_ID.nunique()) + ' out of ' + str(df4.Cell_ID.count()))
print('Site_ID: ' + str(df4.Site_ID.nunique()) + ' out of ' + str(df4.Site_ID.count()))

Product: 3 out of 5001
Value: 242 out of 5001
Date_Time: 708 out of 5001
Cell_On_Site: 7 out of 5001
DW_A_Number_Int: 3903 out of 5001
DW_B_Number_Int: 2848 out of 5001
Country_A: 1 out of 5001
Country_B: 2 out of 5001
Cell_ID: 1790 out of 5001
Site_ID: 1076 out of 4285

In [73]:
# checking unique values for obj having minimal unique obj
print(df4.Product.unique())
print(df4.Cell_On_Site.unique())
print(df4.Country_A.unique())
print(df4.Country_B.unique())

['Voice' 'sms' 'data']
['1' '0' '_' '5' '2' '3' '4']
['19e2e']
['19e2e' 'OTHER']

In [82]:
# checking for duplicates
print(df4[df4.duplicated(keep=False)])

     Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
765      sms      0  2012-05-07 00:00:03.0  ...     19e2e  23c5372bd3  e942f32a29
769      sms     25  2012-05-07 00:00:03.0  ...     19e2e  a6606f4ac1  c6400e443f
793      sms      0  2012-05-07 00:00:03.0  ...     19e2e  23c5372bd3  e942f32a29
794      sms     25  2012-05-07 00:00:03.0  ...     19e2e  a6606f4ac1  c6400e443f
795    Voice      0  2012-05-07 00:00:04.0  ...     19e2e  4a7047f1ba  dea1e52d3b
...      ...    ...                    ...  ...       ...         ...         ...
4864   Voice   1610  2012-05-07 00:01:50.0  ...     19e2e  89b82605a0  5324bc6c24
4932   Voice      0  2012-05-07 00:01:52.0  ...     19e2e  d6abb7e15f  f72cd95f00
4943   Voice      0  2012-05-07 00:01:52.0  ...     19e2e  d6abb7e15f  f72cd95f00
4944   Voice     60  2012-05-07 00:01:53.0  ...     19e2e  fd754bd0d0  e82c07d996
4970   Voice     60  2012-05-07 00:01:53.0  ...     19e2e  fd754bd0d0  e82c07d996

[164 rows x 10 columns]

In [53]:
# checking descriptive stats for CDR dataset 2
df5.info()
df5.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 10 columns):
Product         5000 non-null object
Value           5000 non-null int64
Date_Time       5000 non-null object
Cell_On_Site    5000 non-null object
DW_A_Number     5000 non-null object
DW_B_Number     5000 non-null object
Country_A       5000 non-null object
Country_B       5000 non-null object
Cell_ID         5000 non-null object
Site_ID         4324 non-null object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

             Value
count  5000.000000
mean     24.339800
std      97.480726
min       0.000000
25%       0.000000
50%       0.000000
75%      25.000000
max    3380.000000

In [74]:
# checking null values
df5.isnull().sum()

Product           0
Value             0
Date_Time         0
Cell_On_Site      0
DW_A_Number       0
DW_B_Number       0
Country_A         0
Country_B         0
Cell_ID           0
Site_ID         676
dtype: int64

In [76]:
# checking unique values
print('Product: ' + str(df5.Product.nunique()) + ' out of ' + str(df5.Product.count()))
print('Value: ' + str(df5.Value.nunique()) + ' out of ' + str(df5.Value.count()))
print('Date_Time: ' + str(df5.Date_Time.nunique()) + ' out of ' + str(df5.Date_Time.count()))
print('Cell_On_Site: ' + str(df5.Cell_On_Site.nunique()) + ' out of ' + str(df5.Cell_On_Site.count()))
print('DW_A_Number: ' + str(df5.DW_A_Number.nunique()) + ' out of ' + str(df5.DW_A_Number.count()))
print('DW_B_Number: ' + str(df5.DW_B_Number.nunique()) + ' out of ' + str(df5.DW_B_Number.count()))
print('Country_A: ' + str(df5.Country_A.nunique()) + ' out of ' + str(df5.Country_A.count()))
print('Country_B: ' + str(df5.Country_B.nunique()) + ' out of ' + str(df5.Country_B.count()))
print('Cell_ID: ' + str(df5.Cell_ID.nunique()) + ' out of ' + str(df5.Cell_ID.count()))
print('Site_ID: ' + str(df5.Site_ID.nunique()) + ' out of ' + str(df5.Site_ID.count()))

Product: 3 out of 5000
Value: 242 out of 5000
Date_Time: 787 out of 5000
Cell_On_Site: 8 out of 5000
DW_A_Number: 3799 out of 5000
DW_B_Number: 2882 out of 5000
Country_A: 1 out of 5000
Country_B: 2 out of 5000
Cell_ID: 1661 out of 5000
Site_ID: 1027 out of 4324

In [77]:
# checking unique values for obj having minimal unique obj
print(df5.Product.unique())
print(df5.Cell_On_Site.unique())
print(df5.Country_A.unique())
print(df5.Country_B.unique())

['Voice' 'sms' 'data']
['1' '0' '4' '2' '_' '3' '5' '8']
['19e2e']
['19e2e' 'OTHER']

In [83]:
# checking for duplicates
print(df5[df5.duplicated(keep=False)])

     Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
800    Voice     42  2012-05-08 00:00:01.0  ...     19e2e  7a31902854  55d6d9039c
822    Voice     42  2012-05-08 00:00:01.0  ...     19e2e  7a31902854  55d6d9039c
823    Voice     46  2012-05-08 00:00:02.0  ...     19e2e  4d9b2590ad  0c997709bd
824    Voice      0  2012-05-08 00:00:02.0  ...     19e2e  3aba7c72d7  e188165ebc
835    Voice     46  2012-05-08 00:00:02.0  ...     19e2e  4d9b2590ad  0c997709bd
...      ...    ...                    ...  ...       ...         ...         ...
4878     sms     25  2012-05-08 00:01:50.0  ...     19e2e  777d30093d  aeed65e7ce
4879     sms      0  2012-05-08 00:01:51.0  ...     19e2e  15bdb525ee  6e9b544976
4917     sms      0  2012-05-08 00:01:51.0  ...     19e2e  15bdb525ee  6e9b544976
4972   Voice      0  2012-05-08 00:01:53.0  ...     19e2e  8630058aca  b47a998a3e
4999   Voice      0  2012-05-08 00:01:53.0  ...     19e2e  8630058aca  b47a998a3e

[156 rows x 10 columns]

In [54]:
# checking descriptive stats for CDR dataset 3
df6.info()
df6.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 10 columns):
Product            5000 non-null object
Value              5000 non-null int64
Date_Time          5000 non-null object
Cell_On_Site       5000 non-null object
DW_A_Number_Int    5000 non-null object
DW_B_Number_Int    5000 non-null object
Country_A          5000 non-null object
Country_B          5000 non-null object
Cell_ID            5000 non-null object
Site_ID            4395 non-null object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB

              Value
count   5000.000000
mean      26.434600
std      224.222108
min        0.000000
25%        0.000000
50%        0.000000
75%       25.000000
max    12900.000000

In [78]:
# checkinng null values
df6.isnull().sum()

Product              0
Value                0
Date_Time            0
Cell_On_Site         0
DW_A_Number_Int      0
DW_B_Number_Int      0
Country_A            0
Country_B            0
Cell_ID              0
Site_ID            605
dtype: int64

In [79]:
# checking unique values in CDR dataset 3
# 'Product','Value','Date_Time','Cell_On_Site','DW_A_Number_Int','DW_B_Number_Int','Country_A','Country_B','Cell_ID','Site_ID'

print('Product: ' + str(df6.Product.nunique()) + ' out of ' + str(df6.Product.count()))
print('Value: ' + str(df6.Value.nunique()) + ' out of ' + str(df6.Value.count()))
print('Date_Time: ' + str(df6.Date_Time.nunique()) + ' out of ' + str(df6.Date_Time.count()))
print('Cell_On_Site: ' + str(df6.Cell_On_Site.nunique()) + ' out of ' + str(df6.Cell_On_Site.count()))
print('DW_A_Number_Int: ' + str(df6.DW_A_Number_Int.nunique()) + ' out of ' + str(df6.DW_A_Number_Int.count()))
print('DW_B_Number_Int: ' + str(df6.DW_B_Number_Int.nunique()) + ' out of ' + str(df6.DW_B_Number_Int.count()))
print('Country_A: ' + str(df6.Country_A.nunique()) + ' out of ' + str(df6.Country_A.count()))
print('Country_B: ' + str(df6.Country_B.nunique()) + ' out of ' + str(df6.Country_B.count()))
print('Cell_ID: ' + str(df6.Cell_ID.nunique()) + ' out of ' + str(df6.Cell_ID.count()))
print('Site_ID: ' + str(df6.Site_ID.nunique()) + ' out of ' + str(df6.Site_ID.count()))

Product: 3 out of 5000
Value: 219 out of 5000
Date_Time: 646 out of 5000
Cell_On_Site: 9 out of 5000
DW_A_Number_Int: 3593 out of 5000
DW_B_Number_Int: 2895 out of 5000
Country_A: 1 out of 5000
Country_B: 2 out of 5000
Cell_ID: 1596 out of 5000
Site_ID: 961 out of 4395

In [80]:
# checking unique values for obj having minimal unique obj
print(df6.Product.unique())
print(df6.Cell_On_Site.unique())
print(df6.Country_A.unique())
print(df6.Country_B.unique())

['sms' 'Voice' 'data']
['1' '0' '4' '2' '_' '5' '3' '6' '7']
['19e2e']
['19e2e' 'OTHER']

In [84]:
# checking for duplicates
# checking for duplicates
print(df6[df6.duplicated(keep=False)])

     Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
832      sms     25  2012-05-09 00:00:05.0  ...     19e2e  bf65ca9bc0  ba8ce6e4ef
878     data      0  2012-05-09 00:00:05.0  ...     OTHER  ffa6759bb2         NaN
891      sms     25  2012-05-09 00:00:05.0  ...     19e2e  bf65ca9bc0  ba8ce6e4ef
892     data      0  2012-05-09 00:00:05.0  ...     OTHER  ffa6759bb2         NaN
893      sms     25  2012-05-09 00:00:06.0  ...     19e2e  07ed226112  334fdb9912
...      ...    ...                    ...  ...       ...         ...         ...
4961     sms      0  2012-05-09 00:01:42.0  ...     19e2e  34f124cb0d  73dd78713b
4962     sms      0  2012-05-09 00:01:43.0  ...     19e2e  55becafe68  7430461f18
4963   Voice     32  2012-05-09 00:01:43.0  ...     19e2e  a4731e780e  d68260ef50
4968     sms      0  2012-05-09 00:01:43.0  ...     19e2e  55becafe68  7430461f18
4997   Voice     32  2012-05-09 00:01:43.0  ...     19e2e  a4731e780e  d68260ef50

[186 rows x 10 columns]

# Data Cleaning

In [85]:
# Combine the CDR datasets
df_cdr = pd.concat([df4,df5, df6], axis = 0)
df_cdr.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15001 entries, 0 to 4999
Data columns (total 12 columns):
Cell_ID            15001 non-null object
Cell_On_Site       15001 non-null object
Country_A          15001 non-null object
Country_B          15001 non-null object
DW_A_Number        5000 non-null object
DW_A_Number_Int    10001 non-null object
DW_B_Number        5000 non-null object
DW_B_Number_Int    10001 non-null object
Date_Time          15001 non-null object
Product            15001 non-null object
Site_ID            13004 non-null object
Value              15001 non-null int64
dtypes: int64(1), object(11)
memory usage: 1.5+ MB

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [87]:
# change datatypes of date cols to date for ease of access
df_cdr['Date_Time'] = pd.to_datetime(df_cdr['Date_Time'])

# check if data type changed
df_cdr.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15001 entries, 0 to 4999
Data columns (total 12 columns):
Cell_ID            15001 non-null object
Cell_On_Site       15001 non-null object
Country_A          15001 non-null object
Country_B          15001 non-null object
DW_A_Number        5000 non-null object
DW_A_Number_Int    10001 non-null object
DW_B_Number        5000 non-null object
DW_B_Number_Int    10001 non-null object
Date_Time          15001 non-null datetime64[ns]
Product            15001 non-null object
Site_ID            13004 non-null object
Value              15001 non-null int64
dtypes: datetime64[ns](1), int64(1), object(10)
memory usage: 1.5+ MB

In [88]:
# drop cols that are not required i.e Country A and country B
df_cdr.drop(['Country_A', 'Country_B'], axis = 1)

         Cell_ID Cell_On_Site DW_A_Number  ... Product     Site_ID Value
0     /TJNe+Mmtu            1         NaN  ...   Voice  /TJNe+Mmtu     0
1     /+cKZKIp41            0         NaN  ...     sms  /+cKZKIp41     0
2     /u0FSD+ahi            0         NaN  ...     sms  /u0FSD+ahi    25
3     +cNeJzsTp3            1         NaN  ...   Voice  +cNeJzsTp3    56
4     051KhYDCpv            1         NaN  ...   Voice  051KhYDCpv    14
...          ...          ...         ...  ...     ...         ...   ...
4995  2aa04dcab7            3         NaN  ...   Voice  f7d63a29e5     0
4996  7f1f2f889f            1         NaN  ...   Voice  b4ddb9e93c    62
4997  a4731e780e            1         NaN  ...   Voice  d68260ef50    32
4998  98ed726da2            2         NaN  ...   Voice  b4130b54ab    30
4999  1c11a2fcbb            2         NaN  ...   Voice  6d70dae094    60

[15001 rows x 10 columns]

In [94]:
# drop duplicates
df_cdr = df_cdr.drop_duplicates()
df_cdr.info()   # dropped 253 rows from 15001 to 14748

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14748 entries, 0 to 4999
Data columns (total 12 columns):
Cell_ID            14748 non-null object
Cell_On_Site       14748 non-null object
Country_A          14748 non-null object
Country_B          14748 non-null object
DW_A_Number        4922 non-null object
DW_A_Number_Int    9826 non-null object
DW_B_Number        4922 non-null object
DW_B_Number_Int    9826 non-null object
Date_Time          14748 non-null datetime64[ns]
Product            14748 non-null object
Site_ID            12787 non-null object
Value              14748 non-null int64
dtypes: datetime64[ns](1), int64(1), object(10)
memory usage: 1.5+ MB

In [96]:
# merge CDR and Cell geo data
df_cdr_cells = pd.merge(df_cdr,df2, how='inner', on=['Cell_ID'])
df_cdr_cells.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Data columns (total 22 columns):
Cell_ID            0 non-null object
Cell_On_Site       0 non-null object
Country_A          0 non-null object
Country_B          0 non-null object
DW_A_Number        0 non-null object
DW_A_Number_Int    0 non-null object
DW_B_Number        0 non-null object
DW_B_Number_Int    0 non-null object
Date_Time          0 non-null datetime64[ns]
Product            0 non-null object
Site_ID_x          0 non-null object
Value              0 non-null int64
City               0 non-null object
Status             0 non-null object
Localisation       0 non-null object
Decoup_Zone        0 non-null object
Zone_Name          0 non-null object
Longitude          0 non-null float64
Latitude           0 non-null float64
Region             0 non-null object
Area               0 non-null object
Site_ID_y          0 non-null object
dtypes: datetime64[ns](1), float64(2), int64(1), object(18)
memory usage: 0.0+ bytes

# Data Exploration

Which ones were the most used city for the three days?

In [97]:
# City with the most calls over the last three days
# Count the number of calls per city. The one with the maximum number of calls is the most used city

df_cdr.groupby('Cell_ID').count().nlargest(5,'Product')

            Cell_On_Site  Country_A  Country_B  ...  Product  Site_ID  Value
Cell_ID                                         ...
ffa6759bb2          1960       1960       1960  ...     1960        0   1960
03ee801971            73         73         73  ...       73       73     73
cc7ce19d6b            65         65         65  ...       65       65     65
b78724d6fc            42         42         42  ...       42       42     42
d22224b2fa            40         40         40  ...       40       40     40

[5 rows x 11 columns]

Which cities were the most used during business and home hours?

In [0]:
# Business hours in Cote d'Ivoire are 7:30 - 1800 on weekdays and 8:00 to 12:00 on weekends
# Source: https://www.worldtravelguide.net/guides/africa/ivory-coast/business-communications/

Most used product for the three days

In [98]:
df_cdr.groupby('Product')['Value'].sum()

Product
Voice    306655
data      17285
sms       52377
Name: Value, dtype: int64

Busiest time of the day

Cell with the highest income

In [99]:
df_cdr.groupby('Site_ID')['Value'].sum()

Site_ID
++ctND+jGD    134
+38u2u/rfx    186
+854AcBQT2    154
+Fs4mTvdKx     31
+QZ9qRtNxA     55
             ...
feffc8c92b    297
ff1b78ec81    322
ffa6bdc032    499
ffc9f56819    177
fff5ac6e3f     28
Name: Value, Length: 1357, dtype: int64